#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
linode_instance.db: Refreshing state... [id=33073423]
linode_domain.domain: Refreshing state... [id=1754394]
linode_instance.app: Refreshing state... [id=33073429]
linode_domain_record.rewards: Refreshing state... [id=19660395]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # linode_domain.domain will be updated in-place
  ~ resource "linode_domain" "domain" {
      - domain      = "buildscripts.xyz" -> null
        id          = "1754394"
        tags        = [
            "fealty",
        ]
        # (8 unchanged attributes hidden)
    }

  # linode_domain_record.rewards will be updated in-place
  ~ resource "linode_domain_record" "rewards" {
        id          = "19660395"
        name        = "rewards"
      ~ target      = "172.105.135.75" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # linode_instance.app must be replaced
-/+ resource "linode_instance" "app" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-app Profile" -> (known after apply)
      ~ id                 = "33073429" -> (known after apply)
      ~ image              = "private/15018499" -> "dummy" # forces replacement
      ~ ip_address         = "172.105.135.75" -> (known after apply)
      ~ ipv4               = [
          - "172.105.135.75",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:feab:ab38/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 66631097 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 66631098 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - purpose = "public" -> null
            }
          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 66631097 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 66631098 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      ~ interface {
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # linode_instance.db must be replaced
-/+ resource "linode_instance" "db" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-db Profile" -> (known after apply)
      ~ id                 = "33073423" -> (known after apply)
      ~ image              = "private/15018501" -> "dummy" # forces replacement
      ~ ip_address         = "139.177.200.52" -> (known after apply)
      ~ ipv4               = [
          - "139.177.200.52",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:feab:ab68/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 66631083 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 66631084 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 66631083 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 66631084 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ App_Public_IP   = "172.105.135.75" -> (known after apply)
  ~ Domain_A_Record = "172.105.135.75" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*